app/views/users/index.html.erb


<h2>Tietokannassa <%= pluralize(User.count, 'jäsen', 'jäsentä') %></h2>
---
SELECT COUNT(*) FROM `users`
SELECT `users`.* FROM `users`