app/controllers/retsepts_controller.rb

SELECT `retsepts`.* FROM `retsepts`
---
  def index
    @retsepts = Retsept.all

SELECT  `retsepts`.* FROM `retsepts` WHERE `retsepts`.`id` = 1 LIMIT 1
SELECT `vittuilus`.* FROM `vittuilus` WHERE `vittuilus`.`retsept_id` = 1
---
  def show
	@retsept = Retsept.find(params[:id])
	@vittuilus = @retsept.vittuilus.all

INSERT INTO `retsepts` (`luokka`, `nimi`, `kuvaus`, `ainekset`, `ohjeet`, `aika`, `vaativuus`, `created_at`, `updated_at`) VALUES ('Kastike', 'ruskea', 'perus', '50 g voi\r\n50 g jauho\r\n200 g vesi', '1. paista ja sekoita\r\n2. nauti', 1, 'hlpo', '2015-02-24 20:05:56.857204', '2015-02-24 20:05:56.857204')
---
  def create
    @retsept = Retsept.new(retsept_params)

    respond_to do |format|
      if @retsept.save

UPDATE `retsepts` SET `ohjeet` = 'eijfj', `updated_at` = '2015-04-15 15:09:20.210763' WHERE `retsepts`.`id` = 1
---
  def update
    respond_to do |format|
      if @retsept.update(retsept_params)

SELECT  `retsepts`.* FROM `retsepts` WHERE `retsepts`.`id` = 1 LIMIT 1
---
    def set_retsept
      @retsept = Retsept.find(params[:id])