app/controllers/shakes_controller.rb

  def index
    @shakes = Shake.all
---
SELECT `shakes`.* FROM `shakes`

  def create
    @shake = Shake.new(shake_params)

    respond_to do |format|
      if @shake.save
---
INSERT INTO "shakes" ("nimi", "kuvaus", "arvo", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["nimi", "öglkj"], ["kuvaus", "gjklsjgpas"], ["arvo", 5.0], ["created_at", "2015-01-19 19:09:26.923179"], ["updated_at", "2015-01-19 19:09:26.923179"]]

  def update
    respond_to do |format|
      if @shake.update(shake_params)
---
UPDATE "shakes" SET "nimi" = ?, "kuvaus" = ?, "arvo" = ?, "updated_at" = ? WHERE "shakes"."id" = ?  [["nimi", "Ohrapirtelö"], ["kuvaus", "Purkitettu pieni janojuoma"], ["arvo", 1.0], ["updated_at", "2015-01-19 20:19:34.267231"], ["id", 1]]

  def destroy
    @shake.destroy
---
DELETE FROM "shakes" WHERE "shakes"."id" = ?  [["id", 2]]

    def set_shake
      @shake = Shake.find(params[:id])
---
SELECT  "shakes".* FROM "shakes" WHERE "shakes"."id" = ? LIMIT 1  [["id", 2]]