app/controllers/vittuilus_controller.rb

  def index
    @vittuilus = Vittuilu.all
---
SELECT `vittuilus`.* FROM `vittuilus`

  def create
    @vittuilu = Vittuilu.new(vittuilu_params)

    respond_to do |format|
      if @vittuilu.save
---
INSERT INTO `vittuilus` (`user_nimi`, `teksti`, `retsept_id`, `created_at`, `updated_at`) VALUES ('Яща', 'Люблю', 1, '2015-04-14 15:56:51.939166', '2015-04-14 15:56:51.939166')

  def destroy
    @vittuilu.destroy
---
DELETE FROM `vittuilus` WHERE `vittuilus`.`id` = 2

    def set_vittuilu
      @vittuilu = Vittuilu.find(params[:id])
---
SELECT  `vittuilus`.* FROM `vittuilus` WHERE `vittuilus`.`id` = 2 LIMIT 1